<?php

declare(strict_types=1);

namespace Usuyuki\WakaChain\Repository\Waka;

use Usuyuki\WakaChain\Repository\Waka\Waka;

/**
 * 小倉百人一首のリポジトリ
 */
class Ogura100 extends Waka
{
    public function __construct()
    {
        $this->waka = [
            [
                "JaCC" => ['秋の田の', 'かりほの庵の', '苫をあらみ', 'わが衣手は', '露にぬれつつ'],
                'JaKana' => ['あきのたの', 'かりおのいおの', 'とまをあらみ', 'わがころもでは', 'つゆにぬれつつ'],
            ],
            [
                'JaCC' => ['春過ぎて', '夏来にけらし', '白妙の', '衣ほすてふ', '天の香具山'],
                'JaKana' => ['はるすぎて', 'なつきにけらし', 'しろたえの', 'ころもほすちょう', 'あまのかぐやま'],
            ],
            [
                'JaCC' => ['あしびきの', '山鳥の尾の', 'しだり尾の', '長々し夜を', '独りかも寝む'],
                'JaKana' => ['あしびきの', 'やまどりのおの', 'しだりおの', 'ながながしよを', 'ひとりかもねん'],
            ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
            // [
            //     'JaCC' => ['', '', '', '', ''],
            //     'JaKana' => ['', '', '', '', ''],
            // ],
        ];
    }
}