<?php

declare(strict_types=1);

namespace Usuyuki\WakaChain\Repository\Waka;

use Usuyuki\WakaChain\Repository\Waka\Waka;

/**
 * 小倉百人一首のリポジトリ
 */
class Ogura100 extends Waka
{
    public function __construct()
    {
        $this->waka = [
            [
                'JaCC' => ['秋の田の', 'かりほの庵の', '苫をあらみ', 'わが衣手は', '露にぬれつつ',],
                'JaKana' => ['あきのたの', 'かりほのいほの', 'とまをあらみ', 'わがころもでは', 'つゆにぬれつつ',],
            ],
            [
                'JaCC' => ['春過ぎて', '夏来にけらし', '白妙の', '衣ほすてふ', '天の香具山',],
                'JaKana' => ['はるすぎて', 'なつきにけらし', 'しろたへの', 'ころもほすてふ', 'あまのかぐやま',],
            ],
            [
                'JaCC' => ['足引きの', '山鳥の尾の', 'しだり尾の', 'ながながし', '夜をひとりかもねむ',],
                'JaKana' => ['あしびきの', 'やまどりのおの', 'しだりおの', 'ながながしよを', 'ひとりかもねむ',],
            ],
            [
                'JaCC' => ['田子の浦に', '打出でてみれば', '白妙の', 'ふじの高嶺に', '雪は降りつつ',],
                'JaKana' => ['たごのうらに', 'うちいでてみれば', 'しろたへの', 'ふじのたかねに', 'ゆきはふりつつ',],
            ],
            [
                'JaCC' => ['奥山に', '紅葉ふみ分け', 'なく鹿の', '聲きく時ぞ', '秋は悲しき',],
                'JaKana' => ['おくやまに', 'もみぢふみわけ', 'なくしかの', 'こゑきくときぞ', 'あきはかなしき',],
            ],
            [
                'JaCC' => ['かさゝぎの', '渡せる橋に', 'おく霜の', 'しろきを見れば', '夜ぞふけにける',],
                'JaKana' => ['かささぎの', 'わたせるはしに', 'おくしもの', 'しろきをみれば', 'よぞふけにける',],
            ],
            [
                'JaCC' => ['天の原', 'ふりさけ見れば', '春日なる', 'みかさの山に', '出でし月かも',],
                'JaKana' => ['あまのはら', 'ふりさけみれば', 'かすがなる', 'みかさのやまに', 'いでしつきかも',],
            ],
            [
                'JaCC' => ['わが庵は', '都のたつみ', 'しかぞ住む', '世をうぢ山と', '人はいふなり',],
                'JaKana' => ['わがいほは', 'みやこのたつみ', 'しかぞすむ', 'よをうぢやまと', 'ひとはいふなり',],
            ],
            [
                'JaCC' => ['花の色は', '移りにけりな', '徒に', '我が身世にふる', 'ながめせしまに',],
                'JaKana' => ['はなのいろは', 'うつりにけりな', 'いたづらに', 'わがみよにふる', 'ながめせしまに',],
            ],
            [
                'JaCC' => ['これや此の', '行くも帰るも', '別かれては', '知るも知らぬも', '逢坂の関',],
                'JaKana' => ['これやこの', 'ゆくもかへるも', 'わかれては', 'しるもしらぬも', 'あふさかのせき',],
            ],
            [
                'JaCC' => ['わたの原', '八十島かけて', '漕ぎ出でぬと', '人にはつげよ', 'あまの釣り舟',],
                'JaKana' => ['わたのはら', 'やそしまかけて', 'こぎいでぬと', 'ひとにはつげよ', 'あまのつりぶね',],
            ],
            [
                'JaCC' => ['天つ風', '雲のかよひぢ', '吹きとぢよ', 'をとめの姿', 'しばし留めむ',],
                'JaKana' => ['あまつかぜ', 'くものかよひぢ', 'ふきとぢよ', 'をとめのすがた', 'しばしとどめむ',],
            ],
            [
                'JaCC' => ['筑波嶺の', '峯より落つる', 'みなの川', '戀ぞつもりて', '淵となりぬる',],
                'JaKana' => ['つくばねの', 'みねよりおつる', 'みなのがわ', 'こひぞつもりて', 'ふちとなりぬる',],
            ],
            [
                'JaCC' => ['陸奥の', 'しのぶもぢずり', '誰故に', 'みだれ初めにし', '我ならなくに',],
                'JaKana' => ['みちのくの', 'しのぶもぢずり', 'たれゆゑに', 'みだれそめにし', 'われならなくに',],
            ],
            [
                'JaCC' => ['君がため', '春の野に出でて', '若菜つむ', 'わが衣手に', '雪は降りつつ',],
                'JaKana' => ['きみがため', 'はるののにいでて', 'わかなつむ', 'わがころもでに', 'ゆきはふりつつ',],
            ],
            [
                'JaCC' => ['立別れ', 'いなばの山の', '嶺におふる', 'まつとし聞かば', '今帰り来む',],
                'JaKana' => ['たちわかれ', 'いなばのやまの', 'みねにおふる', 'まつとしきかば', 'いまかへりこむ',],
            ],
            [
                'JaCC' => ['ちはやぶる', '神代も聞かず', '龍田川', 'から紅に', '水くくるとは',],
                'JaKana' => ['ちはやぶる', 'かみよもきかず', 'たつたがは', 'からくれなゐに', 'みづくくるとは',],
            ],
            [
                'JaCC' => ['住の江の', '岸に寄る浪', 'よるさへや', '夢の通ひ路', '人目よくらむ',],
                'JaKana' => ['すみのえの', 'きしによるなみ', 'よるさえや', 'ゆめのかよひぢ', 'ひとめよくらむ',],
            ],
            [
                'JaCC' => ['難波潟', '短き葦の', 'ふしのまも', 'あはで此の世を', 'すぐしてよとや',],
                'JaKana' => ['なにはがた', 'みじかきあしの', 'ふしのまも', 'あはでこのよを', 'すぐしてよとや',],
            ],
            [
                'JaCC' => ['侘びぬれば', '今はた同じ', '難波なる', '身をつくしても', '逢はむとぞ思ふ',],
                'JaKana' => ['わびぬれば', 'いまはたおなじ', 'なにわなる', 'みをつくしても', 'あわんとぞおもう',],
            ],
            [
                'JaCC' => ['今来むと', 'いひしばかりに', '長月の', '有明の月を', '待ち出でつるかな',],
                'JaKana' => ['いまこむと', 'いひしばかりに', 'ながつきの', 'ありあけのつきを', 'まちいでつるかな',],
            ],
            [
                'JaCC' => ['吹くからに', '秋の草木の', 'しをるれば', 'むべ山風を', 'あらしといふらむ',],
                'JaKana' => ['ふくからに', 'あきのくさきの', 'しをるれば', 'むべやまかぜを', 'あらしといふらむ',],
            ],
            [
                'JaCC' => ['月見れば', '千々に物こそ', '悲しけれ', 'わが身ひとつの', '秋にはあらねど',],
                'JaKana' => ['つきみれば', 'ちゞにものこそ', 'かなしけれ', 'わがみひとつの', 'あきにはあらねど',],
            ],
            [
                'JaCC' => ['此の度は', '幣もとりあへず', '手向山', '紅葉の錦', '神のまにまに',],
                'JaKana' => ['このたびは', 'ぬさもとりあへず', 'たむけやま', 'もみぢのにしき', 'かみのまにまに',],
            ],
            [
                'JaCC' => ['名にしおはば', '逢坂山の', 'さねかづら', '人にしられで', 'くるよしもがな',],
                'JaKana' => ['なにしおはば', 'あふさかやまの', 'さねかづら', 'ひとにしられで', 'くるよしもがな',],
            ],
            [
                'JaCC' => ['小倉山', '峯のもみぢ葉', '心あらば', '今ひとたびの', 'みゆき待たなむ',],
                'JaKana' => ['おぐらやま', 'みねのもみぢば', 'こころあらば', 'いまひとたびの', 'みゆきまたなむ',],
            ],
            [
                'JaCC' => ['みかの原', 'わきて流るる', '泉川', 'いつみきとてか', '戀しかるらむ',],
                'JaKana' => ['みかのはら', 'わきてながるる', 'いづみがは', 'いつみきとてか', 'こひしかるらむ',],
            ],
            [
                'JaCC' => ['山里は', '冬ぞ寂しさ', 'まさりける', '人目も草も', 'かれぬと思へば',],
                'JaKana' => ['やまざとは', 'ふゆぞさびしさ', 'まさりける', 'ひとめもくさも', 'かれぬとおもへば',],
            ],
            [
                'JaCC' => ['心あてに', '折らばや折らむ', '初霜の', '置きまどはせる', '白菊の花',],
                'JaKana' => ['こころあてに', 'おらばやおらむ', 'はつしもの', 'おきまどはせる', 'しらぎくのはな',],
            ],
            [
                'JaCC' => ['有明の', 'つれなく見えし', '別れより', '暁ばかり', '憂きものはなし',],
                'JaKana' => ['ありあけの', 'つれなくみえし', 'わかれより', 'あかつきばかり', 'うきものはなし',],
            ],
            [
                'JaCC' => ['朝ぼらけ', '有明の月と', '見るまでに', '吉野の里に', '降れる白雪',],
                'JaKana' => ['あさぼらけ', 'ありあけのつきと', 'みるまでに', 'よしののさとに', 'ふれるしらゆき',],
            ],
            [
                'JaCC' => ['山がはに', '風のかけたる', 'しがらみは', '流れもあへぬ', '紅葉なりけり',],
                'JaKana' => ['やまがはに', 'かぜのかけたる', 'しがらみは', 'ながれもあえぬ', 'もみぢなりけり',],
            ],
            [
                'JaCC' => ['久方の', '光のどけき', '春の日に', 'しづごころなく', '花の散るらむ',],
                'JaKana' => ['ひさかたの', 'ひかりのどけき', 'はるのひに', 'しづごころなく', 'はなのちるらむ',],
            ],
            [
                'JaCC' => ['誰をかも', '知る人にせむ', '高砂の', '松も昔の', '友ならなくに',],
                'JaKana' => ['たれをかも', 'しるひとにせむ', 'たかさごの', 'まつもむかしの', 'ともならなくに',],
            ],
            [
                'JaCC' => ['人はいさ', '心もしらず', 'ふるさとは', '花ぞ昔の', '香ににほひける',],
                'JaKana' => ['ひとはいさ', 'こころもしらず', 'ふるさとは', 'はなぞむかしの', 'かににほひける',],
            ],
            [
                'JaCC' => ['夏の夜は', 'まだ宵ながら', 'あけぬるを', '雲のいづこに', '月宿るらむ',],
                'JaKana' => ['なつのよは', 'まだよひながら', 'あけぬるを', 'くものいづこに', 'つきやどるらむ',],
            ],
            [
                'JaCC' => ['白露に', '風の吹きしく', '秋の野は', 'つらぬきとめぬ', '玉ぞ散りける',],
                'JaKana' => ['しらつゆに', 'かぜのふきしく', 'あきののは', 'つらぬきとめぬ', 'たまぞちりける',],
            ],
            [
                'JaCC' => ['忘らるる', '身をば思はず', '誓ひてし', '人の命の', '惜しくもあるかな',],
                'JaKana' => ['わすらるる', 'みをばおもはず', 'ちかひてし', 'ひとのいのちの', 'をしくもあるかな',],
            ],
            [
                'JaCC' => ['浅茅生の', '小野の篠原', 'しのぶれど', 'あまりてなどか', '人の戀しき',],
                'JaKana' => ['あさぢふの', 'おののしのはら', 'しのぶれど', 'あまりてなどか', 'ひとのこひしき',],
            ],
            [
                'JaCC' => ['忍れど', '色に出でにけり', '我が戀は', 'ものや思ふと', '人の問ふまで',],
                'JaKana' => ['しのぶれど', 'いろにいでにけり', 'わがこひは', 'ものやおもふと', 'ひとのとふまで',],
            ],
            [
                'JaCC' => ['戀すてふ', 'わが名はまだき', '立ちにけり', '人知れずこそ', '思ひそめしか',],
                'JaKana' => ['こひすてふ', 'わがなはまだき', 'たちにけり', 'ひとしれずこそ', 'おもひそめしか',],
            ],
            [
                'JaCC' => ['契りきな', 'かたみに袖を', 'しぼりつつ', '末の松山', '浪こさじとは',],
                'JaKana' => ['ちぎりきな', 'かたみにそでを', 'しぼりつつ', 'すゑのまつやま', 'なみこさじとは',],
            ],
            [
                'JaCC' => ['逢ひみての', '後の心に', 'くらぶれば', '昔はものを', '思はざりけり',],
                'JaKana' => ['あひみての', 'のちのこころに', 'くらぶれば', 'むかしはものを', 'おもはざりけり',],
            ],
            [
                'JaCC' => ['逢ふことの', '絶えてしなくば', 'なかなかに', '人をも身をも', '恨みざらまし',],
                'JaKana' => ['あふことの', 'たえてしなくば', 'なかなかに', 'ひとをもみをも', 'うらみざらまし',],
            ],
            [
                'JaCC' => ['哀れとも', 'いふべき人は', 'おもほえで', '身のいたづらに', 'なりぬべきかな',],
                'JaKana' => ['あはれとも', 'いふべきひとは', 'おもほえで', 'みのいたずらに', 'なりぬべきかな',],
            ],
            [
                'JaCC' => ['由良の戸を', 'わたる舟人', '楫をたえ', '行方もしらぬ', '戀の道かな',],
                'JaKana' => ['ゆらのとを', 'わたるふなびと', 'かぢをたえ', 'ゆくへもしらぬ', 'こひのみちかな',],
            ],
            [
                'JaCC' => ['八重葎', 'しげれる宿の', 'さびしきに', '人こそ見えね', '秋はきにけり',],
                'JaKana' => ['やえむぐら', 'しげれるやどの', 'さびしきに', 'ひとこそみえね', 'あきはきにけり',],
            ],
            [
                'JaCC' => ['風をいたみ', '岩うつ浪の', 'おのれのみ', '砕けてものを', '思ふ頃かな',],
                'JaKana' => ['かぜをいたみ', 'いはうつなみの', 'おのれのみ', 'くだけてものを', 'おもふころかな',],
            ],
            [
                'JaCC' => ['御垣守', '衛士のたく火の', '夜はもえ', '晝は消えつつ', 'ものをこそ思へ',],
                'JaKana' => ['みかきもり', 'ゑじのたくひの', 'よるはもえ', 'ひるはきえつつ', 'ものをこそおもへ',],
            ],
            [
                'JaCC' => ['君がため', '惜しからざりし', '命さへ', '長くもがなと', '思ひけるかな',],
                'JaKana' => ['きみがため', 'をしからざりし', 'いのちさえ', 'ながくもがなと', 'おもひけるかな',],
            ],
            [
                'JaCC' => ['かくとだに', 'えやはいぶきの', 'さしも草', 'さしも知らじな', 'もゆる思ひを',],
                'JaKana' => ['かくとだに', 'えやはいぶきの', 'さしもぐさ', 'さしもしらじな', 'もゆるおもひを',],
            ],
            [
                'JaCC' => ['明けぬれば', 'くるるものとは', '知りながら', 'なほ恨めしき', '朝ぼらけかな',],
                'JaKana' => ['あけぬれば', 'くるるものとは', 'しりながら', 'なほうらめしき', 'あさぼらけかな',],
            ],
            [
                'JaCC' => ['嘆きつつ', '独りぬる夜の', '明くるまは', 'いかに久しき', 'ものとかは知る',],
                'JaKana' => ['なげきつつ', 'ひとりぬるよの', 'あくるまは', 'いかにひさしき', 'ものとかはしる',],
            ],
            [
                'JaCC' => ['忘れじの', '行末までは', '難ければ', '今日を限りの', '命ともがな',],
                'JaKana' => ['わすれじの', 'ゆくすゑまでは', 'かたければ', 'けふをかぎりの', 'いのちともがな',],
            ],
            [
                'JaCC' => ['瀧の音は', 'たえて久しく', 'なりぬれど', '名こそ流れて', 'なほ聞こえけれ',],
                'JaKana' => ['たきのおとは', 'たえてひさしく', 'なりぬれど', 'なこそながれて', 'なほきこえけれ',],
            ],
            [
                'JaCC' => ['あらざらむ', '此の世のほかの', '思ひ出に', '今一たびの', '逢ふこともがな',],
                'JaKana' => ['あらざらむ', 'このよのほかの', 'おもひでに', 'いまひとたびの', 'あふこともがな',],
            ],
            [
                'JaCC' => ['廻り逢ひて', '見しやそれとも', 'わかぬまに', '雲がくれにし', '夜半の月かな',],
                'JaKana' => ['めぐりあひて', 'みしやそれとも', 'わかぬまに', 'くもがくれにし', 'よはのつきかな',],
            ],
            [
                'JaCC' => ['有馬山', 'ゐなのささ原', '風吹けば', 'いでそよ人を', '忘れやはする',],
                'JaKana' => ['ありまやま', 'ゐなのささはら', 'かぜふけば', 'いでそよひとを', 'わすれやはする',],
            ],
            [
                'JaCC' => ['やすらはで', '寝なましものを', '小夜更けて', '傾くまでの', '月を見しかな',],
                'JaKana' => ['やすらはで', 'ねなましものを', 'さよふけて', 'かたぶくまでの', 'つきをみしかな',],
            ],
            [
                'JaCC' => ['大江山', 'いくのの道の', '遠ければ', 'まだふみも見ず', '天の橋立',],
                'JaKana' => ['おおえやま', 'いくののみちの', 'とほければ', 'まだふみもみず', 'あまのはしだて',],
            ],
            [
                'JaCC' => ['古への', '奈良の都の', '八重ざくら', '今日九重に', '匂ひぬるかな',],
                'JaKana' => ['いにしへの', 'ならのみやこの', 'やへざくら', 'けふここのえに', 'におひぬるかな',],
            ],
            [
                'JaCC' => ['夜をこめて', '鳥のそら音は', 'はかるとも', '世に逢坂の', '関はゆるさじ',],
                'JaKana' => ['よをこめて', 'とりのそらねは', 'はかるとも', 'よにあふさかの', 'せきはゆるさじ',],
            ],
            [
                'JaCC' => ['今はただ', '思ひ絶えなむ', 'とばかりを', '人づてならで', '言ふよしもがな',],
                'JaKana' => ['いまはただ', 'おもひたえなむ', 'とばかりを', 'ひとづてならで', 'いふよしもがな',],
            ],
            [
                'JaCC' => ['朝ぼらけ', '宇治の川霧', '絶えだえに', 'あらはれ渡る', '瀬々の網代木',],
                'JaKana' => ['あさぼらけ', 'うぢのかはぎり', 'たえだえに', 'あらはれわたる', 'せぜのあじろぎ',],
            ],
            [
                'JaCC' => ['恨み侘び', 'ほさぬ袖だに', 'あるものを', '戀に朽ちなむ', '名こそ惜しけれ',],
                'JaKana' => ['うらみわび', 'ほさぬそでだに', 'あるものを', 'こひにくちなむ', 'なこそをしけれ',],
            ],
            [
                'JaCC' => ['諸共に', 'あはれと思へ', '山ざくら', '花よりほかに', '知る人もなし',],
                'JaKana' => ['もろともに', 'あはれとおもへ', 'やまざくら', 'はなよりほかに', 'しるひともなし',],
            ],
            [
                'JaCC' => ['春の夜の', '夢ばかりなる', '手枕に', 'かひなく立たむ', '名こそ惜しけれ',],
                'JaKana' => ['はるのよの', 'ゆめばかりなる', 'たまくらに', 'かひなくたたむ', 'なこそをしけれ',],
            ],
            [
                'JaCC' => ['心にも', 'あらで憂世に', 'ながらへば', '戀しかるべき', '夜半の月かな',],
                'JaKana' => ['こころにも', 'あらでうきよに', 'ながらへば', 'こひしかるべき', 'よはのつきかな',],
            ],
            [
                'JaCC' => ['嵐ふく', '三室の山の', 'もみぢ葉は', '龍田の川の', '錦なりけり',],
                'JaKana' => ['あらしふく', 'みむろのやまの', 'もみぢばは', 'たつたのかはの', 'にしきなりけり',],
            ],
            [
                'JaCC' => ['寂しさに', '宿を立ち出でて', '眺むれば', 'いづこも同じ', '秋の夕暮',],
                'JaKana' => ['さびしさに', 'やどをたちいでて', 'ながむれば', 'いづこもおなじ', 'あきのゆふぐれ',],
            ],
            [
                'JaCC' => ['夕されば', '門田の稲葉', 'おとづれて', 'あしのまろやに', '秋風ぞ吹く',],
                'JaKana' => ['ゆふされば', 'かどたのいなば', 'おとづれて', 'あしのまろやに', 'あきかぜぞふく',],
            ],
            [
                'JaCC' => ['音に聞く', '高師の濱の', 'あだ浪は', 'かけじや袖の', 'ぬれもこそすれ',],
                'JaKana' => ['おとにきく', 'たかしのはまの', 'あだなみは', 'かけじやそでの', 'ぬれもこそすれ',],
            ],
            [
                'JaCC' => ['高砂の', '尾の上の桜', '咲きにけり', '外山の霞', '立たずもあらなむ',],
                'JaKana' => ['たかさごの', 'おのへのさくら', 'さきにけり', 'とやまのかすみ', 'たたずもあらなむ',],
            ],
            [
                'JaCC' => ['うかりける', '人を初瀬の', '山おろし', 'はげしかれとは', '祈らぬものを',],
                'JaKana' => ['うかりける', 'ひとをはつせの', 'やまおろし', 'はげしかれとは', 'いのらぬものを',],
            ],
            [
                'JaCC' => ['契りおきし', 'させもが露を', '命にて', 'あはれ今年の', '秋も去ぬめり',],
                'JaKana' => ['ちぎりおきし', 'させもがつゆを', 'いのちにて', 'あはれことしの', 'あきもいぬめり',],
            ],
            [
                'JaCC' => ['わたの原', '漕ぎ出でて見れば', '久方の', '雲居にまがふ', '沖つ白浪',],
                'JaKana' => ['わたのはら', 'こぎいでてみれば', 'ひさかたの', 'くもゐにまがふ', 'おきつしらなみ',],
            ],
            [
                'JaCC' => ['瀬を早み', '岩にせかるる', '瀧川の', 'われても末に', '逢はむとぞ思ふ',],
                'JaKana' => ['せをはやみ', 'いわにせかるる', 'たきがはの', 'われてもすゑに', 'あはむとぞおもふ',],
            ],
            [
                'JaCC' => ['淡路島', 'かよふ千鳥の', '鳴く声に', 'いくよ寝覚めぬ', '須磨の関守',],
                'JaKana' => ['あわじしま', 'かよふちどりの', 'なくこゑに', 'いくよねざめぬ', 'すまのせきもり',],
            ],
            [
                'JaCC' => ['秋風に', 'たなびく雲の', '絶え間より', 'もれ出づる月の', '影のさやけさ',],
                'JaKana' => ['あきかぜに', 'たなびくくもの', 'たえまより', 'もれいづるつきの', 'かげのさやけさ',],
            ],
            [
                'JaCC' => ['ながからむ', '心も知らず', '黒髪の', 'みだれて今朝は', 'ものをこそ思へ',],
                'JaKana' => ['ながからむ', 'こころもしらず', 'くろかみの', 'みだれてけさは', 'ものをこそおもへ',],
            ],
            [
                'JaCC' => ['ほととぎす', '鳴きつる方を', '眺むれば', 'ただ有明の', '月ぞ残れる',],
                'JaKana' => ['ほととぎす', 'なきつるかたを', 'ながむれば', 'ただありあけの', 'つきぞのこれる',],
            ],
            [
                'JaCC' => ['思ひわび', 'さても命は', 'あるものを', '憂きに堪へぬは', '涙なりけり',],
                'JaKana' => ['おもひわび', 'さてもいのちは', 'あるものを', 'うきにたへぬは', 'なみだなりけり',],
            ],
            [
                'JaCC' => ['世の中よ', '道こそなけれ', '思ひ入る', '山の奥にも', '鹿ぞなくなる',],
                'JaKana' => ['よのなかよ', 'みちこそなけれ', 'おもひいる', 'やまのおくにも', 'しかぞなくなる',],
            ],
            [
                'JaCC' => ['ながらへば', 'また此の頃や', 'しのばれむ', '憂しと見し世ぞ', '今は戀しき',],
                'JaKana' => ['ながらへば', 'またこのごろや', 'しのばれむ', 'うしとみしよぞ', 'いまはこひしき',],
            ],
            [
                'JaCC' => ['夜もすがら', 'もの思ふ頃は', '明けやらで', 'ねやのひまさへ', 'つれなかりけり',],
                'JaKana' => ['よもすがら', 'ものおもふころは', 'あけやらで', 'ねやのひまさへ', 'つれなかりけり',],
            ],
            [
                'JaCC' => ['嘆けとて', '月やはものを', '思はする', 'かこち顔なる', 'わが涙かな',],
                'JaKana' => ['なげけとて', 'つきやはものを', 'おもはする', 'かこちがほなる', 'わがなみだかな',],
            ],
            [
                'JaCC' => ['村雨の', '露もまだひぬ', '槇の葉に', '霧立ちのぼる', '秋の夕暮',],
                'JaKana' => ['むらさめの', 'つゆもまだひぬ', 'まきのはに', 'きりたちのぼる', 'あきのゆふぐれ',],
            ],
            [
                'JaCC' => ['難波江の', 'あしのかりねの', '一夜ゆゑ', 'みをつくしてや', '戀ひわたるべき',],
                'JaKana' => ['なにはえの', 'あしのかりねの', 'ひとよゆゑ', 'みをつくしてや', 'こひわたるべき',],
            ],
            [
                'JaCC' => ['玉の緒よ', 'たえなば絶えね', 'ながらへば', '忍ぶることの', '弱りもぞする',],
                'JaKana' => ['たまのをよ', 'たえなばたえね', 'ながらへば', 'しのぶることの', 'よはりもぞする',],
            ],
            [
                'JaCC' => ['見せばやな', '雄島のあまの', '袖だにも', '濡れにぞ濡れし', '色はかはらず',],
                'JaKana' => ['みせばやな', 'をじまのあまの', 'そでだにも', 'ぬれにぞぬれし', 'いろはかはらず',],
            ],
            [
                'JaCC' => ['きりぎりす', 'なくや霜夜の', 'さむしろに', '衣かたしき', '獨りかも寝む',],
                'JaKana' => ['きりぎりす', 'なくやしもよの', 'さむしろに', 'ころもかたしき', 'ひとりかもねむ',],
            ],
            [
                'JaCC' => ['わが袖は', '汐干に見えぬ', '沖の石の', '人こそ知らね', '乾く間もなし',],
                'JaKana' => ['わがそでは', 'しほひにみえぬ', 'おきのいしの', 'ひとこそしらね', 'かわくまもなし',],
            ],
            [
                'JaCC' => ['世の中は', '常にもがもな', '渚こぐ', '海士の小舟の', '綱手かなしも',],
                'JaKana' => ['よのなかは', 'つねにもがもな', 'なぎさこぐ', 'あまのをぶねの', 'つなでかなしも',],
            ],
            [
                'JaCC' => ['みよしのの', '山の秋風', '小夜更けて', '故郷寒く', '衣うつなり',],
                'JaKana' => ['みよしのの', 'やまのあきかぜ', 'さよふけて', 'ふるさとさむく', 'ころもうつなり',],
            ],
            [
                'JaCC' => ['おほけなく', 'うき世の民に', 'おほふかな', '我が立つ杣に', '墨染の袖',],
                'JaKana' => ['おほけなく', 'うきよのたみに', 'おほふかな', 'わがたつそまに', 'すみぞめのそで',],
            ],
            [
                'JaCC' => ['花さそふ', 'あらしの庭の', '雪ならで', 'ふりゆくものは', '我が身なりけり',],
                'JaKana' => ['はなさそふ', 'あらしのにはの', 'ゆきならで', 'ふりゆくものは', 'わがみなりけり',],
            ],
            [
                'JaCC' => ['来ぬ人を', '松帆の浦の', '夕なぎに', '焼くや藻塩の', '身もこがれつつ',],
                'JaKana' => ['こぬひとを', 'まつほのうらの', 'ゆふなぎに', 'やくやもしほの', 'みもこがれつつ',],
            ],
            [
                'JaCC' => ['風そよぐ', '楢の小川の', '夕ぐれは', 'みそぎぞ夏の', 'しるしなりける',],
                'JaKana' => ['かぜそよぐ', 'ならのをがわの', 'ゆふぐれは', 'みそぎぞなつの', 'しるしなりける',],
            ],
            [
                'JaCC' => ['人もをし', '人もうらめし', 'あぢきなく', '世を思ふ故に', 'もの思ふ身は',],
                'JaKana' => ['ひともをし', 'ひともうらめし', 'あぢきなく', 'よをおもふゆゑに', 'ものおもふみは',],
            ],
            [
                'JaCC' => ['百敷や', '古き軒端の', 'しのぶにも', 'なほあまりある', '昔なりけり',],
                'JaKana' => ['ももしきや', 'ふるきのきばの', 'しのぶにも', 'なほあまりある', 'むかしなりけり',],
            ],
            [
                'JaCC' => ['難波津に', '咲くやこの花', '冬ごもり', '今を春べと', '咲くやこの花',],
                'JaKana' => ['なにわづに', 'さくやこのはな', 'ふゆごもり', 'いまをはるべと', 'さくやこのはな',],
            ],

        ];
    }
}